In [2]:
import numpy as np

In [3]:
import pandas as pd
# My SQL toolkit
import pymssql  # For connecting to Microsoft SQL Server
from sqlalchemy import create_engine  # For creating database engine connections
# PostgreSQL
import psycopg2  # For connecting to PostgreSQL

# Example usage (optional, to show how they might work together)
# engine = create_engine('postgresql+psycopg2://user:password@localhost:5432/dbname')
# df = pd.read_sql('SELECT * FROM table_name', engine)

In [4]:
df=pd.read_csv('Walmart.csv')

In [5]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [6]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [8]:
df.duplicated().sum()

np.int64(51)

In [9]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [10]:
df.drop_duplicates(inplace=True)

In [11]:
df.shape

(10000, 11)

In [12]:
#dropping null values
df.dropna(inplace=True)

In [13]:
df.shape

(9969, 11)

In [14]:
df['unit_price']=df['unit_price'].str.replace('[$,]', '', regex=True).astype(float)

In [15]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [16]:
df['total_cost']=df['unit_price']*df['quantity']

In [17]:
from sqlalchemy import create_engine, text
import getpass

# Prompting for password (optional: hardcode it if you prefer)
password = getpass.getpass("Enter your PostgreSQL password: ")

# Database connection string
DATABASE_URL = f'postgresql+psycopg2://postgres:{password}@localhost:5432/sqlproject'

# Create the engine
engine = create_engine(DATABASE_URL)

# Try connecting
try:
    with engine.connect() as connection:
        print("✅ Connected to PostgreSQL database")
        result = connection.execute(text("SELECT version();"))
        print(f"PostgreSQL version: {result.fetchone()[0]}")
except Exception as e:
    print("❌ Error connecting to the database:")
    print(e)
finally:
    engine.dispose()

✅ Connected to PostgreSQL database
PostgreSQL version: PostgreSQL 17.4 on x86_64-windows, compiled by msvc-19.42.34436, 64-bit

In [22]:
df.to_sql('walmart_sales', engine, if_exists='replace', index=False)

969

In [21]:
df.columns=df.columns.str.lower()